// 1. Вивести на сторінку в один рядок через кому числа від 10 до 20.
let resultOfTask1 = '';
for(let i = 10; i <= 20; i++) {
    resultOfTask1 = resultOfTask1 + i;
    if (i < 20) {
        resultOfTask1 = resultOfTask1  + ', ';
    }
}
console.log('1. Вивести на сторінку в один рядок через кому числа від 10 до 20.');
console.log(resultOfTask1);
console.log('-----------------------------------------');

// 2. Вивести квадрати чисел від 10 до 20.
console.log('2. Вивести квадрати чисел від 10 до 20.');
for(let i = 10; i <= 20; i++) {
    console.log(`Квадрат числа ${i} = ${i*i}`);
}
console.log('-----------------------------------------');

// 3. Вивести таблицю множення на 7.
console.log('Вивести таблицю множення на 7.');
let j = 7;
for(let i = 1; i <= 10; i++) {
    console.log(`${j} * ${i} = ${j*i}`);
}
console.log('-----------------------------------------');

// 4. Знайти суму всіх цілих чисел від 1 до 15.
console.log('4. Знайти суму всіх цілих чисел від 1 до 15.');
let sum4 = 0;
for(let i = 1; i <= 15; i++) {
    sum4 += i;
}
console.log(sum4);
console.log('-----------------------------------------');

// 5. Знайти добуток усіх цілих чисел від 15 до 35.
console.log('5. Знайти добуток усіх цілих чисел від 15 до 35.');
let product = 1;
for (let i = 15; i <= 35; i++) {
    product *= i;
}
console.log(product);
console.log('-----------------------------------------');

// 6. Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
console.log('6. Знайти середнє арифметичне всіх цілих чисел від 1 до 500.');
let sum6 = 0;
let count6 = 0;
for (let i = 1; i <= 500; i++) {
    sum6 += i;
    count6++;
}
let result6 = sum6 / count6;
console.log(result6);
console.log('-----------------------------------------');

// 7. Вивести суму лише парних чисел в діапазоні від 30 до 80.
console.log('7. Вивести суму лише парних чисел в діапазоні від 30 до 80.');
let sum7 = 0;
for(let i = 30; i <= 80; i++) {
    if(i % 2 === 0) {
        sum7 += i;
    }
}
console.log(sum7);
console.log('-----------------------------------------');

// 8. Вивести всі числа в діапазоні від 100 до 200 кратні 3.
console.log('8. Вивести всі числа в діапазоні від 100 до 200 кратні 3.');
for(let i = 100; i <= 200; i++) {
    if(i % 3 === 0) {
        console.log(i);
    }
}
console.log('-----------------------------------------');

// 9. Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
console.log('9. Дано натуральне число. Знайти та вивести на сторінку всі його дільники.');
const naturalNumber = parseInt(prompt('9. Введіть натуральне число:'));
if (isNaN(naturalNumber) || naturalNumber <= 0) {
    console.log('Введено некоректне число або не натуральне.');
} else {
    console.log(`Дільники числа ${naturalNumber}:`);
    for (let i = 1; i <= naturalNumber; i++) {
        if (naturalNumber % i === 0) {
            console.log(i);
        }
    }
}
console.log('-----------------------------------------');

// 10. Визначити кількість його парних дільників.
// 11. Знайти суму його парних дільників.
console.log(`10. Кількість парних дільників числа ${naturalNumber}:`);
let result10 = 0;
let sum11 = 0;
for (let i = 1; i <= naturalNumber; i++) {
    if (naturalNumber % i === 0 && i % 2 === 0) {
        result10++;
        sum11 += i;
    }
}
console.log(result10);
console.log('-----------------------------------------');
// 11. Знайти суму його парних дільників.
console.log(`11. Сума парних дільників числа ${naturalNumber}:`);
console.log(sum11);
console.log('-----------------------------------------');

// 12. Надрукувати повну таблицю множення від 1 до 10.
console.log('12. Надрукувати повну таблицю множення від 1 до 10.');
for (i = 1; i <= 10; i++) {
    for (j = 1; j <= 10; j++) {
        console.log(`${i} * ${j} = ${i*j}`);
    }
    console.log(' ');
}